<?php

namespace App\Database\Seeds;

use App\Models\UsersLevelsModel;
use CodeIgniter\Database\Seeder;

class UserLevelsSeeder extends Seeder {
    private array $insertData = [
        [1,  0,     'Путешественник', ''],
        [2,  50,    'Открыватель', ''],
        [3,  100,   'Турист-новичок', ''],
        [4,  200,   'Экскурсант', ''],
        [5,  350,   'Исследователь', ''],
        [6,  500,   'Турист 1 класса', ''],
        [8,  1000,  'Профи Экскурсовод', ''],
        [9,  1300,  'Экскурсовод 1 класса', ''],
        [10, 1700,  'Экскурсовод 2 класса', ''],
        [11, 2200,  'Эксперт', ''],
        [12, 2800,  'Мастер экскурсовод', ''],
        [13, 3500,  'Авантюрист', ''],
        [14, 4300,  'Эксперт 1 класса', ''],
        [15, 5200,  'Турист-разведчик', ''],
        [16, 6200,  'Путешественник-начинающий', ''],
        [17, 7300,  'Глобетроттер', ''],
        [18, 8500,  'Завсегдатай', ''],
        [19, 9800,  'Культурный исследователь', ''],
        [20, 11200, 'Природный исследователь', ''],
        [21, 12700, 'Архитектурный гуру', ''],
        [22, 14300, 'Гурман-путешественник', ''],
        [23, 16000, 'Фотограф-любитель', ''],
        [24, 17800, 'Фотограф-профессионал', ''],
        [25, 19700, 'Горный альпинист', ''],
        [26, 21700, 'Песчаный афиционадо', ''],
        [27, 23800, 'Подводный исследователь', ''],
        [28, 23800, 'Экскурсовод', ''],
        [29, 23800, 'Туристический автор', ''],
        [30, 30700, 'Глобальный гид', ''],
    ];

    public function run(): void {
        $userLevelsModel = new UsersLevelsModel();
        $tempInsertData  = [];

        foreach ($this->insertData as $value) {
            $tempInsertData[] = [
                'level'      => $value[0],
                'experience' => $value[1],
                'name'       => $value[2],
                'text'       => $value[3],
            ];
        }

        $userLevelsModel->insertBatch($tempInsertData);
    }
}
